---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
source: html/968273e6-0923-5e16-4c3d-229487514385.htm
---
# AnalyticalSurfaceBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.